In [3]:
%load_ext sql

In [6]:
from urllib.parse import quote_plus

password = quote_plus("pooja2005@#E")
connection_string = f"mysql+mysqlconnector://root:{password}@localhost/productiondb"

%sql {connection_string}

In [7]:
%%sql
show databases;

 * mysql+mysqlconnector://root:***@localhost/productiondb
14 rows affected.

[('bank_management',),
 ('bankmanagement',),
 ('community_tracker',),
 ('information_schema',),
 ('mysql',),
 ('pd_da_cloud',),
 ('performance_schema',),
 ('practice',),
 ('production',),
 ('productiondb',),
 ('productionschedule',),
 ('speech_sign_db',),
 ('sys',),
 ('web',)]

In [8]:
%%sql
use pd_da_cloud;

 * mysql+mysqlconnector://root:***@localhost/productiondb
0 rows affected.

[]

In [9]:
%%sql
create table test(sno int,name varchar(100));

 * mysql+mysqlconnector://root:***@localhost/productiondb
0 rows affected.

[]

In [15]:
%%sql
select * from test;

 * mysql+mysqlconnector://root:***@localhost/productiondb
2 rows affected.

[(1, 'diya'), (2, 'pooja')]

In [14]:
%%sql
insert into test(sno,name)values(2,'pooja');

 * mysql+mysqlconnector://root:***@localhost/productiondb
1 rows affected.

[]

In [20]:
%%sql
update test set name='farmaan',sno=3 where sno=1;
insert into test(sno,name)values(1,'akshat');

 * mysql+mysqlconnector://root:***@localhost/productiondb
0 rows affected.
1 rows affected.

[]

In [21]:
%%sql
select * from test;

 * mysql+mysqlconnector://root:***@localhost/productiondb
3 rows affected.

[(3, 'farmaan'), (2, 'pooja'), (1, 'akshat')]

In [22]:
%%sql
delete from test where sno=3;

 * mysql+mysqlconnector://root:***@localhost/productiondb
1 rows affected.

[]

In [24]:
%%sql
select * from test;

 * mysql+mysqlconnector://root:***@localhost/productiondb
2 rows affected.

[(2, 'pooja'), (1, 'akshat')]

In [26]:
%%sql
drop table if exists employees

 * mysql+mysqlconnector://root:***@localhost/productiondb
0 rows affected.

[]

In [27]:
%%sql
create table employees(empid int primary key,
name varchar(100) not null,
job varchar(100) not null,
dept varchar(50) not null,
salary int);

 * mysql+mysqlconnector://root:***@localhost/productiondb
0 rows affected.

[]

In [40]:
%%sql
truncate table employees;

 * mysql+mysqlconnector://root:***@localhost/productiondb
0 rows affected.

[]

In [41]:
%%sql
insert into employees values (1, 'Employee1', 'Software Engineer', 'IT', 75000);
insert into employees values (2, 'Employee2', 'Data Analyst', 'Analytics', 82000);
insert into employees values (3, 'Employee3', 'HR Manager', 'HR', 70000);
insert into employees values (4, 'Employee4', 'Project Manager', 'Management', 95000);
insert into employees values (5, 'Employee5', 'System Admin', 'IT', 68000);
insert into employees values (6, 'Employee6', 'Business Analyst', 'Analytics', 87000);
insert into employees values (7, 'Employee7', 'Recruiter', 'HR', 66000);
insert into employees values (8, 'Employee8', 'Team Lead', 'Management', 91000);
insert into employees values (9, 'Employee9', 'Cloud Engineer', 'IT', 99000);
insert into employees values (10, 'Employee10', 'AI Specialist', 'Analytics', 97000);


insert into employees values (11, 'Employee11', 'Software Engineer', 'IT', 58000);
insert into employees values (12, 'Employee12', 'Data Analyst', 'Analytics', 55000);
insert into employees values (13, 'Employee13', 'HR Executive', 'HR', 46000);
insert into employees values (14, 'Employee14', 'Project Coordinator', 'Management', 52000);
insert into employees values (15, 'Employee15', 'IT Support', 'IT', 48000);
insert into employees values (16, 'Employee16', 'Junior Analyst', 'Analytics', 50000);
insert into employees values (17, 'Employee17', 'HR Assistant', 'HR', 42000);
insert into employees values (18, 'Employee18', 'Operations Assistant', 'Management', 59000);
insert into employees values (19, 'Employee19', 'Junior Developer', 'IT', 54000);
insert into employees values (20, 'Employee20', 'Intern Analyst', 'Analytics', 30000);

insert into employees values (21, 'Employee21', 'Software Tester', 'IT', 47000);
insert into employees values (22, 'Employee22', 'Data Intern', 'Analytics', 32000);
insert into employees values (23, 'Employee23', 'HR Coordinator', 'HR', 41000);
insert into employees values (24, 'Employee24', 'Assistant Manager', 'Management', 60000);
insert into employees values (25, 'Employee25', 'System Trainee', 'IT', 35000);
insert into employees values (26, 'Employee26', 'BI Intern', 'Analytics', 40000);
insert into employees values (27, 'Employee27', 'HR Trainee', 'HR', 37000);
insert into employees values (28, 'Employee28', 'Junior PM', 'Management', 58000);
insert into employees values (29, 'Employee29', 'Frontend Intern', 'IT', 36000);
insert into employees values (30, 'Employee30', 'Analytics Assistant', 'Analytics', 39000);

insert into employees values (31, 'Employee31', 'Support Engineer', 'IT', 50000);
insert into employees values (32, 'Employee32', 'Data Entry', 'Analytics', 25000);
insert into employees values (33, 'Employee33', 'HR Intern', 'HR', 28000);
insert into employees values (34, 'Employee34', 'Junior Coordinator', 'Management', 47000);
insert into employees values (35, 'Employee35', 'Desktop Support', 'IT', 42000);
insert into employees values (36, 'Employee36', 'Junior BI Analyst', 'Analytics', 43000);
insert into employees values (37, 'Employee37', 'HR Assistant', 'HR', 31000);
insert into employees values (38, 'Employee38', 'Management Intern', 'Management', 39000);
insert into employees values (39, 'Employee39', 'Web Developer Intern', 'IT', 27000);
insert into employees values (40, 'Employee40', 'Data Helper', 'Analytics', 35000);

insert into employees values (41, 'Employee41', 'Junior Engineer', 'IT', 58000);
insert into employees values (42, 'Employee42', 'Report Analyst', 'Analytics', 49000);
insert into employees values (43, 'Employee43', 'HR Officer', 'HR', 53000);
insert into employees values (44, 'Employee44', 'Management Assistant', 'Management', 57000);
insert into employees values (45, 'Employee45', 'Helpdesk Support', 'IT', 44000);
insert into employees values (46, 'Employee46', 'Data Technician', 'Analytics', 48000);
insert into employees values (47, 'Employee47', 'HR Clerk', 'HR', 33000);
insert into employees values (48, 'Employee48', 'Junior Ops', 'Management', 42000);
insert into employees values (49, 'Employee49', 'Trainee Developer', 'IT', 39000);
insert into employees values (50, 'Employee50', 'Analytics Trainee', 'Analytics', 37000);

 * mysql+mysqlconnector://root:***@localhost/productiondb
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [42]:
%%sql
select * from employees;

 * mysql+mysqlconnector://root:***@localhost/productiondb
50 rows affected.

[(1, 'Employee1', 'Software Engineer', 'IT', 75000),
 (2, 'Employee2', 'Data Analyst', 'Analytics', 82000),
 (3, 'Employee3', 'HR Manager', 'HR', 70000),
 (4, 'Employee4', 'Project Manager', 'Management', 95000),
 (5, 'Employee5', 'System Admin', 'IT', 68000),
 (6, 'Employee6', 'Business Analyst', 'Analytics', 87000),
 (7, 'Employee7', 'Recruiter', 'HR', 66000),
 (8, 'Employee8', 'Team Lead', 'Management', 91000),
 (9, 'Employee9', 'Cloud Engineer', 'IT', 99000),
 (10, 'Employee10', 'AI Specialist', 'Analytics', 97000),
 (11, 'Employee11', 'Software Engineer', 'IT', 58000),
 (12, 'Employee12', 'Data Analyst', 'Analytics', 55000),
 (13, 'Employee13', 'HR Executive', 'HR', 46000),
 (14, 'Employee14', 'Project Coordinator', 'Management', 52000),
 (15, 'Employee15', 'IT Support', 'IT', 48000),
 (16, 'Employee16', 'Junior Analyst', 'Analytics', 50000),
 (17, 'Employee17', 'HR Assistant', 'HR', 42000),
 (18, 'Employee18', 'Operations Assistant', 'Management', 59000),
 (19, 'Employee19', 'Junior Developer', 'IT', 54000),
 (20, 'Employee20', 'Intern Analyst', 'Analytics', 30000),
 (21, 'Employee21', 'Software Tester', 'IT', 47000),
 (22, 'Employee22', 'Data Intern', 'Analytics', 32000),
 (23, 'Employee23', 'HR Coordinator', 'HR', 41000),
 (24, 'Employee24', 'Assistant Manager', 'Management', 60000),
 (25, 'Employee25', 'System Trainee', 'IT', 35000),
 (26, 'Employee26', 'BI Intern', 'Analytics', 40000),
 (27, 'Employee27', 'HR Trainee', 'HR', 37000),
 (28, 'Employee28', 'Junior PM', 'Management', 58000),
 (29, 'Employee29', 'Frontend Intern', 'IT', 36000),
 (30, 'Employee30', 'Analytics Assistant', 'Analytics', 39000),
 (31, 'Employee31', 'Support Engineer', 'IT', 50000),
 (32, 'Employee32', 'Data Entry', 'Analytics', 25000),
 (33, 'Employee33', 'HR Intern', 'HR', 28000),
 (34, 'Employee34', 'Junior Coordinator', 'Management', 47000),
 (35, 'Employee35', 'Desktop Support', 'IT', 42000),
 (36, 'Employee36', 'Junior BI Analyst', 'Analytics', 43000),
 (37, 'Employee37', 'HR Assistant', 'HR', 31000),
 (38, 'Employee38', 'Management Intern', 'Management', 39000),
 (39, 'Employee39', 'Web Developer Intern', 'IT', 27000),
 (40, 'Employee40', 'Data Helper', 'Analytics', 35000),
 (41, 'Employee41', 'Junior Engineer', 'IT', 58000),
 (42, 'Employee42', 'Report Analyst', 'Analytics', 49000),
 (43, 'Employee43', 'HR Officer', 'HR', 53000),
 (44, 'Employee44', 'Management Assistant', 'Management', 57000),
 (45, 'Employee45', 'Helpdesk Support', 'IT', 44000),
 (46, 'Employee46', 'Data Technician', 'Analytics', 48000),
 (47, 'Employee47', 'HR Clerk', 'HR', 33000),
 (48, 'Employee48', 'Junior Ops', 'Management', 42000),
 (49, 'Employee49', 'Trainee Developer', 'IT', 39000),
 (50, 'Employee50', 'Analytics Trainee', 'Analytics', 37000)]

In [43]:
%%sql
drop table high_paid_emp;

 * mysql+mysqlconnector://root:***@localhost/productiondb
0 rows affected.

[]

In [44]:
%%sql
create table high_paid_emp as select empid,name,job,dept,salary from employees where salary>60000

 * mysql+mysqlconnector://root:***@localhost/productiondb
10 rows affected.

[]

In [45]:
%%sql
select * from high_paid_emp;

 * mysql+mysqlconnector://root:***@localhost/productiondb
10 rows affected.

[(1, 'Employee1', 'Software Engineer', 'IT', 75000),
 (2, 'Employee2', 'Data Analyst', 'Analytics', 82000),
 (3, 'Employee3', 'HR Manager', 'HR', 70000),
 (4, 'Employee4', 'Project Manager', 'Management', 95000),
 (5, 'Employee5', 'System Admin', 'IT', 68000),
 (6, 'Employee6', 'Business Analyst', 'Analytics', 87000),
 (7, 'Employee7', 'Recruiter', 'HR', 66000),
 (8, 'Employee8', 'Team Lead', 'Management', 91000),
 (9, 'Employee9', 'Cloud Engineer', 'IT', 99000),
 (10, 'Employee10', 'AI Specialist', 'Analytics', 97000)]

In [47]:
%%sql
create temporary table temp_high_pay(empid int,salary decimal(10,2));

 * mysql+mysqlconnector://root:***@localhost/productiondb
0 rows affected.

[]

In [50]:
%%sql
alter table employees add email varchar(60);

 * mysql+mysqlconnector://root:***@localhost/productiondb
0 rows affected.

[]

In [52]:
%%sql
desc employees;

 * mysql+mysqlconnector://root:***@localhost/productiondb
6 rows affected.

[('empid', 'int', 'NO', 'PRI', None, ''),
 ('name', 'varchar(100)', 'NO', '', None, ''),
 ('job', 'varchar(100)', 'NO', '', None, ''),
 ('dept', 'varchar(50)', 'NO', '', None, ''),
 ('salary', 'int', 'YES', '', None, ''),
 ('email', 'varchar(60)', 'YES', '', None, '')]

In [54]:
%%sql
alter table employees drop column dept;

 * mysql+mysqlconnector://root:***@localhost/productiondb
0 rows affected.

[]

In [56]:
%%sql
alter table employees rename to emptab;

 * mysql+mysqlconnector://root:***@localhost/productiondb
0 rows affected.

[]

In [58]:
%%sql
desc emptab;

 * mysql+mysqlconnector://root:***@localhost/productiondb
5 rows affected.

[('empid', 'int', 'NO', 'PRI', None, ''),
 ('name', 'varchar(100)', 'NO', '', None, ''),
 ('job', 'varchar(100)', 'NO', '', None, ''),
 ('salary', 'int', 'YES', '', None, ''),
 ('email', 'varchar(60)', 'YES', '', None, '')]

In [60]:
%%sql
drop table rides;

 * mysql+mysqlconnector://root:***@localhost/productiondb
0 rows affected.

[]